title: Enable WDigest using PowerShell
id: bda01c73-45bc-4997-8c63-f993ec08e87e
status: experimental
description: Rule to detect registry modifications to enable WDigest using powershell over the commandline.
author: The DFIR Report
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
date: 2022/06/06
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains|all:
            - 'Set-ItemProperty'
            - 'WDigest'
            - 'UseLogonCredential'
            - 'Value'
            - '1'
    condition: selection
falsepositives:
    - Admin activity
level: medium
