title: Exchange Webshell creation
description: These commands were used to create a webshell by exploiting ProxyShell vulnerabilities
author: 'The DFIR Report, @thedfirreport'
date: 2022/5/14
references:
    - https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - 'New-ManagementRoleAssignment -Role "Mailbox Import Export" -User "administrator@'
    selection_2:
        CommandLine|contains|all:
            - 'New-MailboxExportRequest -Mailbox'
            - '-FilePath "\\localhost\C$'
            - '-IncludeFolders ("#Drafts#")'
            - 'aspx'
    condition: 1 of them
falsepositives:
    - Legitimate Administrator activity
level: medium
status: experiemntal
tags:
    - attack.t1100
    - attack.t1190
