title: PSEXEC Custom Named Service Binary
status: experimental
description: PSEXEC execututed with non default service binary name
references:
    - thedfirreport.com
author: @TheDFIRReport
date: 2022/04/24
logsource:
    product: windows
    category: process_creation
detection:
    selection: 
        Image|endswith: '\psexec.exe'
        CommandLine|contains: ' -r '
    condition: selection
falsepositives:
    - Unknown
level: medium
