title: Operator Bloopers Cobalt Strike Modules
id: 507249b7-7adc-4cda-8edd-8577b431bee3
status: experimental
description: Detects use of Cobalt Strike module commands accidentally entered in the CMD shell
author: _pete_0, TheDFIRReport
references:
  - https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
  - https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
date: 2022/05/06
modified: 2022/05/06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - Invoke-UserHunter
      - Invoke-ShareFinder
      - Invoke-Kerberoast
      - Invoke-SMBAutoBrute
      - Invoke-Nightmare
      - zerologon
      - av_query
    Image|endswith:
      - '\cmd.exe'
  condition: selection
fields:
  - CommandLine
falsepositives:
  - Unknown
level: high
tags:
  - attack.execution
  - attack.t1059.003
