title: SSH over port 443 with known Server and Client Strings
id: 3c5791a2-8f29-413d-b511-90918ecb33b7
status: experimental
description: Will detect the presence of known SSH client and SSH server strings that have been used for SSH tunneling.
author: iiamaleks,TheDFIRReport
date: 2022-06-06
modified: 2024-02-23
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
logsource:
    product: zeek
    service: ssh
detection:
    selection_port:
        destination_port: 443
    selection_ssh_client:
        zeek_ssh_client: "SSH-2.0-PuTTY_Release_0.76"
    selection_ssh_server:
        zeek_ssh_server: "SSH-2.0-9.17 FlowSsh: Bitvise SSH Server (WinSSHD) 9.17"
    condition: all of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.command-and-control
    - attack.t1572
