title: Invoke-ShareFinder Script Block Execution
id: 5e93e240-5484-458a-9663-18157e01e897
status: experimental
description: |
    Use of Invoke-ShareFinder detected via PowerShell Script Block logging
references:
    - https://thedfirreport.com/2023-01-23/sharefinder-how-threat-actors-discover-file-shares/
    - https://powersploit.readthedocs.io/en/stable/Recon/README/

author: "The DFIR Report"
date: 2023-01-23
modified: 2025-02-07
tags:
    - attack.discovery
    - attack.t1135
    - dist.public
logsource:
    product: windows
    service: powershell
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    selection:
        ScriptBlockText|contains: 'Invoke-ShareFinder'
    condition: selection
falsepositives:
    - Unknown
level: high
