title: Disable Windows Defender via Service
id: 92f0538f-ad13-4776-9366-b7351d51c4b8
status: test
description: Detects Windows Defender disabling service installation
references:
   - https://thedfirreport.com/2024/02/26/seo-poisoning-to-domain-control-the-gootloader-saga-continues/
author: _pete_0, TheDFIRReport
date: 2024-02-17
tags:
    - attack.execution
    - attack.t1569.002
    - attack.t1562.001
    - dist.public
logsource:
    product: windows
    service: system
detection:
    selection_eid:
        Provider_Name: 'Service Control Manager'
        EventID: 7045
    selection_image:
        ImagePath|contains|all:
            - 'Set-MpPreference'
            - '-DisableRealtimeMonitoring'
            - 'powershell'
    condition: all of selection_*
falsepositives:
    - Unknown
level: medium
