title: Invoke-ShareFinder Discovery Activity
id: fbedfe8c-3e02-4f3c-b521-4b83d5054fd1
status: experimental
description: |
    Use of Invoke-ShareFinder detected via PowerShell logging
references:
    - https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares
    - https://powersploit.readthedocs.io/en/stable/Recon/README/

author: TheDFIRReport
date: 01/22/2023

tags:
    - attack.discovery
    - attack.t1135
logsource:
    product: windows
    category: ps_module
    definition: 'Requirements: PowerShell Module Logging must be enabled'
detection:
    selection_4103:
        Payload|contains: 'Invoke-ShareFinder'
    condition: selection_4103
falsepositives:
    - Unknown
level: High
