title: AnyDesk Network
id: b26feb0b-8891-4e66-b2e7-ec91dc045d58
status: experimental
description: Detects use of AnyDesk
author: _pete_0, TheDFIRReport
references:
  - https://support.anydesk.com/knowledge/firewall
date: 2022/05/06
modified: 2022/05/06
logsource:
  category: dns_query
  product: windows
detection:
  selection:
    QueryName|contains:
      - '.anydesk.com'
    Image|endswith:
      - '\anydesk.exe'
  condition: selection
falsepositives:
  - Legitimate AnyDesk installation
level: high
tags:
  - attack.lateral_movement
  - attack.t1133
  - attack.command_and_control
  - attack.t1219
