title: DNS Query for Ufile.io Upload Domain
id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
description: Detects DNS queries for subdomains used for upload to ufile.io
status: experimental
author: yatinwad and TheDFIRReport
date: 2021-12-13
modified: 2024-02-23
references:
    - https://thedfirreport.com/2021/12/13/diavol-ransomware/
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    service: dns_query
detection:
    dns_request:
        QueryName|contains: ufile.io
    condition: dns_request
falsepositives:
    - unknown
level: high

