title: Data Exfiltration via AWS CLI
id: e7732014-c4b9-4653-92b2-aa7cfe154bf7
status: experimental
description: Detects usage of AWS CLI to exfiltrate data
references:
    - https://thedfirreport.com/2024/04/29/from-icedid-to-dagon-locker-ransomware-in-29-days/
    - https://awscli.amazonaws.com/v2/documentation/api/latest/reference/s3/cp.html
author: TheDFIRReport
date: 2024/03/22
modified: 2024/04/23
tags:
    - attack.exfiltration
    - attack.t1567.002
    - dist.public
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains|all:
            - 's3 cp'
            - '--recursive'
            - '--region'
            - '--endpoint-url'
    condition: selection
falsepositives:
    - Some administrators or automation could use AWS CLI to transfer data to S3.
level: medium
