title: Nslookup Local
id: ffef5004-f1ec-48bb-8662-8dfd4f9a4902
status: Experimental
description: Detects use of nslookup to look up the local nameserver as part of host discovery
author: _pete_0, TheDFIRReport
references:
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/nslookup
  - https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts
date: 2023/01/08
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\nslookup.exe'
    CommandLine|contains:
      - '127.0.0.1'
    ParentImage|endswith:
      - '\cmd.exe'
    ParentCommandLine|contains:
      - '/c'
  condition: selection
fields:
  - CommandLine
  - ParentCommandLine
falsepositives:
  - Administrators, helpdesk
level: high
tags:
  - attack.discovery
  - attack.t1016
