title: Bumblebee WmiPrvSE execution pattern
id: 1620db43-fde5-45f3-b4d9-45ca6e79e047
status: experimental
description: Detects Bumblebee WmiPrvSE parent process manipulation
author:  TheDFIRReport
references:
    - https://thedfirreport.com/2022/09/26/bumblebee-round-two/
date: 2022-09-26
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        ParentImage:endswith: 'WmiPrvSE.exe'
        Image|endswith:
            - 'ImagingDevices.exe'
            - 'wabmig.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense-evasion
    - attack.t1036
