title: System Time Lookup
id: 9bd28cfc-143f-4df2-9a13-968e31aa12de
status: Experimental
description: Detects use of time to look up the system time as part of host discovery
author: _pete_0, TheDFIRReport
references:
  - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/time
  - https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts
date: 2023/01/08
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
      - '/c'
      - 'time'
    Image|endswith:
      - '\cmd.exe'
  condition: selection
fields:
  - CommandLine
falsepositives:
  - Unknown
level: high
tags:
  - attack.discovery
  - attack.t1124
