title: FlawedGrace spawning threat injection target
id: 295e71e5-38c9-4a59-90dd-9fa7bf617b4b
description: Detecting the command FlawedGrace is using for the purpose of injecting into it the spawned process, in this case the cmd.exe process.
status: experimental
date: 2023-06-12
modified: 2024-02-23
author: "@kostastsale, @TheDFIRReport"
references:
    - https://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|endswith: '\cmd.exe'
        CommandLine|contains|all:
            - ' /I '
            - ' /SI '
    selection_2:
        Image|endswith: '\cmd.exe'
        CommandLine|contains|all:
            - ' /O '
            - ' /SO '
    condition: 1 of selection_*
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense-evasion #TA0005
    - attack.t1055
    - dist.public
