title: Default Account Usage
id: dca5d253-d738-4ec4-b530-381ece784d42
description: Threat actor (APT35) created user, enabled it, set password, add to admins and remote desktop users.
author: 'The DFIR Report'
date: 2022/5/14
modified: 2023/01/08
references:
    - https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'net user /add DefaultAccount'
            - 'net user DefaultAccount /active:yes'
            - 'net localgroup Administrators /add DefaultAccount'
            - 'net localgroup ''Remote Desktop Users'' /add DefaultAccount'
    condition: selection
falsepositives:
    - Legitimate Administrator activity
level: medium
status: experimental
tags:
    - attack.t1136
    - attack.t1136.001
