title: SplashTop Process
id: 20b92a34-13d8-4bf0-a6d6-8c4ea8fedd40
status: experimental
description: Detects use of SplashTop
author: _pete_0, TheDFIRReport
references:
  - https://support-splashtopbusiness.splashtop.com/hc/en-us/articles/212724303-Why-does-the-Splashtop-software-show-unable-to-reach-Splashtop-servers-
  - https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
date: 2022/05/06
modified: 2022/05/06
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Product|contains:
      - 'SplashTop'
    Description|contains:
      - 'SplashTop'
  condition: selection
falsepositives:
  - Legitimate SplashTop installation
level: high
tags:
  - attack.lateral_movement
  - attack.t1133
  - attack.command_and_control
  - attack.t1219
