title: WinEvent Security Query
id: 0b4a3c5d-75f0-4483-91fc-13ef54380aea
status: Experimental
description: Detects querying of Windows Security log for account activity
author: _pete_0, TheDFIRReport
references:
  - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-eventlog?view=powershell-5.1
  - https://thedfirreport.com/2023/04/03/malicious-iso-file-leads-to-domain-wide-ransomware
date: 2023/04/02
modified: 2024/02/23
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\powershell.exe'
        CommandLine|contains:
            - 'get-eventlog'
            - 'security'
            - 'export-csv'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: high
tags:
    - attack.t1033
