title: Deleting Windows Defender scheduled tasks
id: 2a6239f4-fefa-4080-adba-196f8006b54e
status: experimental
description: Detects the deletion of scheduled tasks related to Windows Defender.
author: 'Kostastsale, TheDFIRReport'
references:
    - https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
date: 2022-05-09
modified: 2024-02-23
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\schtasks.exe'
        CommandLine|contains|all:
            - '/delete'
            - '/tn'
            - 'Windows Defender'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.defense-evasion
    - attack.t1562.001
