title: QBot process creation from scheduled task REGSVR32 (regsvr32.exe), -s flag and SYSTEM in the command line
id: 33d9c3f4-57a6-4ddb-a2a0-b2ccf8482607
status: test
description: Detects the process creation from Scheduled Task with REGSVR32 (regsvr32.exe), -s flag and SYSTEM in the command line 
author: tas_kmanager, TheDFIRReport
references: 
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
date: 2022/02/06
modified: 2023/01/08
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all: 
      - 'schtasks.exe'
      - 'regsvr32.exe -s'
      - 'SYSTEM'
  condition: selection
falsepositives:
  - unknown
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1053.005
  - attack.S0650
  - attack.qbot
