title: Registry Query for WDigest
id: cf23c788-c4de-4607-9205-68b2b11f5029
status: experimental
description: Rule to detect discovery activity for WDigest registry settings
author: The DFIR Report
references:
    - https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
date: 2022/06/05
modified: 2024/02/23
tags:
    - attack.discovery
    - attack.t1012
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\reg.exe'
        CommandLine|contains|all:
            - 'query'
            - 'WDigest'
            - 'UseLogonCredential'
    condition: selection
falsepositives:
    - Admin activity
    - Auditing software
level: medium
