title: Exchange Webshell creation
id: 3086329b-245b-4b91-a0f7-bed9b5438cf6
description: These commands were used to create a webshell by exploiting ProxyShell vulnerabilities
author: 'The DFIR Report'
date: 2022/5/14
modified: 2023/01/08
references:
    - https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        CommandLine|contains|all:
            - 'New-ManagementRoleAssignment -Role "Mailbox Import Export" -User "administrator@'
    selection_2:
        CommandLine|contains|all:
            - 'New-MailboxExportRequest -Mailbox'
            - '-FilePath "\\localhost\C$'
            - '-IncludeFolders ("#Drafts#")'
            - 'aspx'
    condition: selection_1 or selection_2
falsepositives:
    - Legitimate Administrator activity
level: medium
status: experimental
tags:
    - attack.t1100
    - attack.t1190
