title: AdFind Discovery
id: 50046619-1037-49d7-91aa-54fc92923604
description: AdFind has been seen in numerous intrusions. The threat actor(s) ran these commands.
author: 'The DFIR Report'
date: 2022-05-14
modified: 2024-02-23
references:
    - https://thedfirreport.com/2020/05/08/adfind-recon/
    - https://thedfirreport.com/?s=adfind
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains:
            - 'adfind -gcb -sc trustdmp'
            - 'adfind -f "(objectcategory=group)"'
            - 'adfind -f (objectcategory=group)'
            - 'adfind -subnets -f (objectCategory=subnet)'
            - 'adfind -sc trustdmp'
            - 'adfind -f "(objectcategory=organizationalUnit)"'
            - 'adfind -f (objectcategory=organizationalUnit)'
            - 'adfind -f "objectcategory=computer"'
            - 'adfind -f objectcategory=computer'
            - 'adfind -f "(objectcategory=person)"'
            - 'adfind -f (objectcategory=person)'
    renamed:
        CommandLine|contains:
            - '-gcb -sc trustdmp'
            - '-f "(objectcategory=group)"'
            - '-f (objectcategory=group)'
            - '-subnets -f (objectCategory=subnet)'
            - '-sc trustdmp'
            - '-f "(objectcategory=organizationalUnit)"'
            - '-f (objectcategory=organizationalUnit)'
            - '-f "objectcategory=computer"'
            - '-f objectcategory=computer'
            - '-f "(objectcategory=person)"'
            - '-f (objectcategory=person)'
    condition: selection or renamed
falsepositives:
    - Legitimate Administrator using tool for Active Directory querying.
level: medium
status: stable
tags:
    - attack.discovery
    - attack.t1018
    - attack.t1482
    - attack.t1069.002
    - attack.t1087.002
    - attack.s0552
