title: Ursnif Loader
id: 4da2fad6-ec4f-4ec6-a7ce-398dc4ff61b5
status: Experimental
description: Detects a very specific command the Ursnif loader runs.
author: svch0st, TheDFIRReport
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/time
    - https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts
date: 2023/01/08
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: 'syswow64\cmd.exe'
        CommandLine|contains|all:
            - '/C'
            - 'pause dll mail'
    condition: selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: high
