title: Emotet Child Process Spawn Pattern
id: 50e8cf53-62df-49aa-bbde-8b3a0a6d8a35
status: Experimental
description: Detects Emotet Spawning ipconfig and systeminfo.
author:  TheDFIRReport
references:
    - https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
    - Case 15184
date: 2022/10/03
logsource:
  category: process_creation
  product: windows
detection:
    selection:
        ParentImage|endswith: 'regsvr32.exe'
        ParentCommandLine|contains: '.dll'
        CommandLine:
            - 'ipconfig /all'
            - 'systeminfo'
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.discovery
    - attack.t1087
